Revit 2027 API
Transform.BasisY Property
The basis of the Y axis of this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ BasisY { get; set; }
Public Property BasisY As XYZ
	Get
	Set
public:
property XYZ^ BasisY {
	XYZ^ get ();
	void set (XYZ^ value);
}
member BasisY : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the transform is internally marked as read-only.
Remarks
 The Y axis of the old coordinate system in the new coordinate system, or the 2nd column of the conventional 3x4 matrix representation.
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace